bakerstu/openmrn/boards/ti-lm4f120xl-launchpad-ek/startup.c
/** \copyright
 * Copyright (c) 2014, Stuart W Baker
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are  permitted provided that the following conditions are met:
 * 
 *  - Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 *  - Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \file main.c
 * This file sets up the runtime environment for TI Stellaris/Tiva MCUs.
 *
 * @author Stuart W. Baker
 * @date 4 May 2014
 */

#include "inc/lm4f120h5qr.h"

#include <stdint.h>

#include "FreeRTOSConfig.h"

/* prototypes */
extern unsigned long *__stack;
extern void reset_handler(void);
static void nmi_handler(void);
static void hard_fault_handler(void);
static void mpu_fault_handler(void);
static void bus_fault_handler(void);
static void usage_fault_handler(void);

extern void SVC_Handler(void);
extern void PendSV_Handler(void);
extern void SysTick_Handler(void);

extern void __libc_init_array(void);

extern int main(int argc, char *argv[]);

extern void debug_interrupt_handler(void);
extern void porta_interrupt_handler(void);
extern void portb_interrupt_handler(void);
extern void portc_interrupt_handler(void);
extern void portd_interrupt_handler(void);
extern void porte_interrupt_handler(void);
extern void uart0_interrupt_handler(void);
extern void uart1_interrupt_handler(void);
extern void ssi0_interrupt_handler(void);
extern void i2c0_interrupt_handler(void);
extern void pwm0_fault_interrupt_handler(void);
extern void pwm0_0_interrupt_handler(void);
extern void pwm0_1_interrupt_handler(void);
extern void pwm0_2_interrupt_handler(void);
extern void qei0_interrupt_handler(void);
extern void adc0_seq0_interrupt_handler(void);
extern void adc0_seq1_interrupt_handler(void);
extern void adc0_seq2_interrupt_handler(void);
extern void adc0_seq3_interrupt_handler(void);
extern void watchdog_interrupt_handler(void);
extern void timer0a_interrupt_handler(void);
extern void timer0b_interrupt_handler(void);
extern void timer1a_interrupt_handler(void);
extern void timer1b_interrupt_handler(void);
extern void timer2a_interrupt_handler(void);
extern void timer2b_interrupt_handler(void);
extern void comparator0_interrupt_handler(void);
extern void comparator1_interrupt_handler(void);
extern void comparator2_interrupt_handler(void);
extern void system_control_interrupt_handler(void);
extern void flash_interrupt_handler(void);
extern void portf_interrupt_handler(void);
extern void portg_interrupt_handler(void);
extern void porth_interrupt_handler(void);
extern void uart2_interrupt_handler(void);
extern void ssi1_interrupt_handler(void);
extern void timer3a_interrupt_handler(void);
extern void timer3b_interrupt_handler(void);
extern void i2c1_interrupt_handler(void);
extern void qei1_interrupt_handler(void);
extern void can0_interrupt_handler(void);
extern void can1_interrupt_handler(void);
extern void ethernet_interrupt_handler(void);
extern void hibernation_interrupt_handler(void);
extern void usb0_interrupt_handler(void);
extern void pwm0_3_interrupt_handler(void);
extern void dma_software_interrupt_handler(void);
extern void dma_error_interrupt_handler(void);
extern void adc1_seq0_interrupt_handler(void);
extern void adc1_seq1_interrupt_handler(void);
extern void adc1_seq2_interrupt_handler(void);
extern void adc1_seq3_interrupt_handler(void);
extern void i2s0_interrupt_handler(void);
extern void epi_interrupt_handler(void);
extern void portj_interrupt_handler(void);
extern void portk_interrupt_handler(void);
extern void portl_interrupt_handler(void);
extern void ssi2_interrupt_handler(void);
extern void ssi3_interrupt_handler(void);
extern void uart3_interrupt_handler(void);
extern void uart4_interrupt_handler(void);
extern void uart5_interrupt_handler(void);
extern void uart6_interrupt_handler(void);
extern void uart7_interrupt_handler(void);
extern void i2c2_interrupt_handler(void);
extern void i2c3_interrupt_handler(void);
extern void timer4a_interrupt_handler(void);
extern void timer4b_interrupt_handler(void);
extern void timer5a_interrupt_handler(void);
extern void timer5b_interrupt_handler(void);
extern void wide_timer0a_interrupt_handler(void);
extern void wide_timer0b_interrupt_handler(void);
extern void wide_timer1a_interrupt_handler(void);
extern void wide_timer1b_interrupt_handler(void);
extern void wide_timer2a_interrupt_handler(void);
extern void wide_timer2b_interrupt_handler(void);
extern void wide_timer3a_interrupt_handler(void);
extern void wide_timer3b_interrupt_handler(void);
extern void wide_timer4a_interrupt_handler(void);
extern void wide_timer4b_interrupt_handler(void);
extern void wide_timer5a_interrupt_handler(void);
extern void wide_timer5b_interrupt_handler(void);
extern void system_except_interrupt_handler(void);
extern void i2c4_interrupt_handler(void);
extern void i2c5_interrupt_handler(void);
extern void portm_interrupt_handler(void);
extern void portn_interrupt_handler(void);
extern void portp_interrupt_handler(void);
extern void portp0_interrupt_handler(void);
extern void portp1_interrupt_handler(void);
extern void portp2_interrupt_handler(void);
extern void portp3_interrupt_handler(void);
extern void portp4_interrupt_handler(void);
extern void portp5_interrupt_handler(void);
extern void portp6_interrupt_handler(void);
extern void portp7_interrupt_handler(void);
extern void pwm1_0_interrupt_handler(void);
extern void pwm1_1_interrupt_handler(void);
extern void pwm1_2_interrupt_handler(void);
extern void pwm1_3_interrupt_handler(void);
extern void pwm1_fault_interrupt_handler(void);

