bakerstu/openmrn/boards/ti-lm4f120xl-launchpad-ek/startup.c
/** Exception table */
__attribute__ ((section(".interrupt_vector")))
void (* const __interrupt_vector[])(void) =
{
    (void (*)(void))(&__stack),      /**<   0 initial stack pointer */
    reset_handler,                   /**<   1 reset vector */
    nmi_handler,                     /**<   2 non-maskable interrupt */
    hard_fault_handler,              /**<   3 hard fault */
    mpu_fault_handler,               /**<   4 memory managment */
    bus_fault_handler,               /**<   5 bus Fault */
    usage_fault_handler,             /**<   6 usage fault */
    0,                               /**<   7 reserved */
    0,                               /**<   8 reserved */
    0,                               /**<   9 reserved */
    0,                               /**<  10 reserved */
    SVC_Handler,                     /**<  11 SV call */
    debug_interrupt_handler,         /**<  12 debug monitor */
    0,                               /**<  13 reserved */
    PendSV_Handler,                  /**<  14 pend SV */
    SysTick_Handler,                 /**<  15 system tick */
    porta_interrupt_handler,         /**<  16 GPIO port A */
    portb_interrupt_handler,         /**<  17 GPIO port B */
    portc_interrupt_handler,         /**<  18 GPIO port C */
    portd_interrupt_handler,         /**<  19 GPIO port D */
    porte_interrupt_handler,         /**<  20 GPIO port E */
    uart0_interrupt_handler,         /**<  21 UART0 */
    uart1_interrupt_handler,         /**<  22 UART1 */
    ssi0_interrupt_handler,          /**<  23 SSI0 */
    i2c0_interrupt_handler,          /**<  24 I2C0 */
    pwm0_fault_interrupt_handler,    /**<  25 PWM0 fault */
    pwm0_0_interrupt_handler,        /**<  26 PWM0 generator 0 */
    pwm0_1_interrupt_handler,        /**<  27 PWM0 generator 1 */
    pwm0_2_interrupt_handler,        /**<  28 PWM0 generator 2 */
    qei0_interrupt_handler,          /**<  29 QEI0 */
    adc0_seq0_interrupt_handler,     /**<  30 ADC0 Sequence 0 */
    adc0_seq1_interrupt_handler,     /**<  31 ADC0 Sequence 1 */
    adc0_seq2_interrupt_handler,     /**<  32 ADC0 Sequence 2 */
    adc0_seq3_interrupt_handler,     /**<  33 ADC0 Sequence 3 */
    watchdog_interrupt_handler,      /**<  34 watchdog timers 0 and 1 */
    timer0a_interrupt_handler,       /**<  35 timer 0A */
    timer0b_interrupt_handler,       /**<  36 timer 0B */
    timer1a_interrupt_handler,       /**<  37 timer 1A */
    timer1b_interrupt_handler,       /**<  38 timer 1B */
    timer2a_interrupt_handler,       /**<  39 timer 2A */
    timer2b_interrupt_handler,       /**<  40 timer 2B */
    comparator0_interrupt_handler,   /**<  41 analog comparator 0 */
    comparator1_interrupt_handler,   /**<  42 analog comparator 1 */
    comparator2_interrupt_handler,   /**<  43 analog comparator 2 */
    system_control_interrupt_handler,/**<  44 system control */
    flash_interrupt_handler,         /**<  45 FLASH memory Ccontrol */
    portf_interrupt_handler,         /**<  46 GPIO port F */
    portg_interrupt_handler,         /**<  47 GPIO port G */
    porth_interrupt_handler,         /**<  48 GPIO port H */
    uart2_interrupt_handler,         /**<  49 UART2 */
    ssi1_interrupt_handler,          /**<  50 SSI1 */
    timer3a_interrupt_handler,       /**<  51 timer 3A */
    timer3b_interrupt_handler,       /**<  52 timer 3B */
    i2c1_interrupt_handler,          /**<  53 I2C1 */
    qei1_interrupt_handler,          /**<  54 QEI1 */
    can0_interrupt_handler,          /**<  55 CAN0 */
    can1_interrupt_handler,          /**<  56 CAN1 */
    0,                               /**<  57 reserved */
    ethernet_interrupt_handler,      /**<  58 ethernet controller */
    hibernation_interrupt_handler,   /**<  59 hibernation module */
    usb0_interrupt_handler,          /**<  60 USB */
    pwm0_3_interrupt_handler,        /**<  61 PWM0 generator 3 */
    dma_software_interrupt_handler,  /**<  62 uDMA software */
    dma_error_interrupt_handler,     /**<  63 uDMA error */
    adc1_seq0_interrupt_handler,     /**<  64 ADC1 Sequence 0 */
    adc1_seq1_interrupt_handler,     /**<  65 ADC1 Sequence 1 */
    adc1_seq2_interrupt_handler,     /**<  66 ADC1 Sequence 2 */
    adc1_seq3_interrupt_handler,     /**<  67 ADC1 Sequence 3 */
    i2s0_interrupt_handler,          /**<  68 I2S0 */
    epi_interrupt_handler,           /**<  69 EPI */
    portj_interrupt_handler,         /**<  70 GPIO port J */
    portk_interrupt_handler,         /**<  71 GPIO port K */
    portl_interrupt_handler,         /**<  72 GPIO port L */
    ssi2_interrupt_handler,          /**<  73 SSI2 */
    ssi3_interrupt_handler,          /**<  74 SSI3 */
    uart3_interrupt_handler,         /**<  75 UART3 */
    uart4_interrupt_handler,         /**<  76 UART4 */
    uart5_interrupt_handler,         /**<  77 UART5 */
    uart6_interrupt_handler,         /**<  78 UART6 */
    uart7_interrupt_handler,         /**<  79 UART7 */
    0,                               /**<  80 reserved */
    0,                               /**<  81 reserved */
    0,                               /**<  82 reserved */
    0,                               /**<  83 reserved */
    i2c2_interrupt_handler,          /**<  84 I2C2 */
    i2c3_interrupt_handler,          /**<  85 I2C3 */
    timer4a_interrupt_handler,       /**<  86 timer 4A */
    timer4b_interrupt_handler,       /**<  87 timer 4B */
    0,                               /**<  88 reserved */
    0,                               /**<  89 reserved */
    0,                               /**<  90 reserved */
    0,                               /**<  91 reserved */
    0,                               /**<  92 reserved */
    0,                               /**<  93 reserved */
    0,                               /**<  94 reserved */
    0,                               /**<  95 reserved */
    0,                               /**<  96 reserved */
    0,                               /**<  97 reserved */
    0,                               /**<  98 reserved */
    0,                               /**<  99 reserved */
    0,                               /**< 100 reserved */
    0,                               /**< 101 reserved */
    0,                               /**< 102 reserved */
    0,                               /**< 103 reserved */
    0,                               /**< 104 reserved */
    0,                               /**< 105 reserved */
    0,                               /**< 106 reserved */
    0,                               /**< 107 reserved */
    timer5a_interrupt_handler,       /**< 108 timer 5A */
    timer5b_interrupt_handler,       /**< 109 timer 5B */
    wide_timer0a_interrupt_handler,  /**< 110 wide timer 0A */
    wide_timer0b_interrupt_handler,  /**< 111 wide timer 0B */
    wide_timer1a_interrupt_handler,  /**< 112 wide timer 1A */
    wide_timer1b_interrupt_handler,  /**< 113 wide timer 1B */
    wide_timer2a_interrupt_handler,  /**< 114 wide timer 2A */
    wide_timer2b_interrupt_handler,  /**< 115 wide timer 2B */
    wide_timer3a_interrupt_handler,  /**< 116 wide timer 3A */
    wide_timer3b_interrupt_handler,  /**< 117 wide timer 3B */
    wide_timer4a_interrupt_handler,  /**< 118 wide timer 4A */
    wide_timer4b_interrupt_handler,  /**< 119 wide timer 4B */
    wide_timer5a_interrupt_handler,  /**< 120 wide timer 5A */
    wide_timer5b_interrupt_handler,  /**< 121 wide timer 5B */
    system_except_interrupt_handler, /**< 122 system exception (imprecise) */
    0,                               /**< 123 reserved */
    0,                               /**< 124 reserved */
    i2c4_interrupt_handler,          /**< 125 I2C2 */
    i2c5_interrupt_handler,          /**< 126 I2C3 */
    portm_interrupt_handler,         /**< 127 GPIO port M */
    portn_interrupt_handler,         /**< 128 GPIO port N */
    0,                               /**< 129 reserved */
    0,                               /**< 130 reserved */
    0,                               /**< 131 reserved */
    portp_interrupt_handler,         /**< 132 GPIO port P (summary or P0) */
    portp1_interrupt_handler,        /**< 133 GPIO port P1 */
    portp2_interrupt_handler,        /**< 134 GPIO port P2 */
    portp3_interrupt_handler,        /**< 135 GPIO port P3 */
    portp4_interrupt_handler,        /**< 136 GPIO port P4 */
    portp5_interrupt_handler,        /**< 137 GPIO port P5 */
    portp6_interrupt_handler,        /**< 138 GPIO port P6 */
    portp7_interrupt_handler,        /**< 139 GPIO port P7 */
    0,                               /**< 140 reserved */
    0,                               /**< 141 reserved */
    0,                               /**< 142 reserved */
    0,                               /**< 143 reserved */
    0,                               /**< 144 reserved */
    0,                               /**< 145 reserved */
    0,                               /**< 146 reserved */
    0,                               /**< 147 reserved */
    0,                               /**< 148 reserved */
    0,                               /**< 149 reserved */
    pwm1_0_interrupt_handler,        /**< 150 PWM1 generator 0 */
    pwm1_1_interrupt_handler,        /**< 151 PWM1 generator 1 */
    pwm1_2_interrupt_handler,        /**< 152 PWM1 generator 2 */
    pwm1_2_interrupt_handler,        /**< 153 PWM1 generator 3 */
    pwm1_fault_interrupt_handler,    /**< 154 PWM1 fault */
};

