bakerstu/openmrn/boards/ti-lm4f120xl-launchpad-ek/startup.c
extern unsigned long __data_section_table;
extern unsigned long __data_section_table_end;
extern unsigned long __bss_section_table;
extern unsigned long __bss_section_table_end;

extern unsigned long _etext;
extern unsigned long _data;
extern unsigned long _edata;
extern unsigned long _bss;
extern unsigned long _ebss;

/** Startup the C/C++ runtime environment.
 */
void reset_handler(void)
{
    unsigned long *section_table_addr = &__data_section_table;

    /* copy ram load sections from flash to ram */
    while (section_table_addr < &__data_section_table_end)
    {
        unsigned long *src = (unsigned long *)*section_table_addr++;
        unsigned long *dst = (unsigned long *)*section_table_addr++;
        unsigned long  len = (unsigned long)  *section_table_addr++;

        for ( ; len; len -= 4)
        {
            *dst++ = *src++;
        }
    }

    /* zero initialize bss segment(s) */
    while (section_table_addr < &__bss_section_table_end)
    {
        unsigned long *zero = (unsigned long *)*section_table_addr++;
        unsigned long  len  = (unsigned long)  *section_table_addr++;
        
        for ( ; len; len -= 4)
        {
            *zero++ = 0;
        }
    }

    /* call static constructors */
    __libc_init_array();

    /* execute main */
    char *argv[] = {0};
    main(0, argv);

    for ( ; /* forever */ ;)
    {
        /* if we ever return from main, loop forever */
    }
}

extern void resetblink(unsigned long pattern);
//extern void diewith(unsigned pattern);

volatile uint32_t r0;
volatile uint32_t r1;
volatile uint32_t r2;
volatile uint32_t r3;
volatile uint32_t r12;
volatile uint32_t lr; /* Link register. */
volatile uint32_t pc; /* Program counter. */
volatile uint32_t psr;/* Program status register. */

/** Decode the stack state prior to an exception occuring.  This code is
 * inspired by FreeRTOS.
 * @param address address of the stack
 */
__attribute__((__naked__)) void hard_fault_handler_c( unsigned long *hardfault_args )
{
    /* These are volatile to try and prevent the compiler/linker optimising them
    away as the variables never actually get used.  If the debugger won't show the
    values of the variables, make them global my moving their declaration outside
    of this function. */
    volatile unsigned long stacked_r0 ;
    volatile unsigned long stacked_r1 ;
    volatile unsigned long stacked_r2 ;
    volatile unsigned long stacked_r3 ;
    volatile unsigned long stacked_r12 ;
    volatile unsigned long stacked_lr ;
    volatile unsigned long stacked_pc ;
    volatile unsigned long stacked_psr ;
    volatile unsigned long _CFSR ;
    volatile unsigned long _HFSR ;
    volatile unsigned long _DFSR ;
    volatile unsigned long _AFSR ;
    volatile unsigned long _BFAR ;
    volatile unsigned long _MMAR ;

    stacked_r0 = ((unsigned long)hardfault_args[0]) ;
    stacked_r1 = ((unsigned long)hardfault_args[1]) ;
    stacked_r2 = ((unsigned long)hardfault_args[2]) ;
    stacked_r3 = ((unsigned long)hardfault_args[3]) ;
    stacked_r12 = ((unsigned long)hardfault_args[4]) ;
    stacked_lr = ((unsigned long)hardfault_args[5]) ;
    stacked_pc = ((unsigned long)hardfault_args[6]) ;
    stacked_psr = ((unsigned long)hardfault_args[7]) ;

    // Configurable Fault Status Register
    // Consists of MMSR, BFSR and UFSR
    _CFSR = (*((volatile unsigned long *)(0xE000ED28))) ;   
                                                                                    
    // Hard Fault Status Register
    _HFSR = (*((volatile unsigned long *)(0xE000ED2C))) ;

    // Debug Fault Status Register
    _DFSR = (*((volatile unsigned long *)(0xE000ED30))) ;

    // Auxiliary Fault Status Register
    _AFSR = (*((volatile unsigned long *)(0xE000ED3C))) ;

    // Read the Fault Address Registers. These may not contain valid values.
    // Check BFARVALID/MMARVALID to see if they are valid values
    // MemManage Fault Address Register
    _MMAR = (*((volatile unsigned long *)(0xE000ED34))) ;
    // Bus Fault Address Register
    _BFAR = (*((volatile unsigned long *)(0xE000ED38))) ;

    __asm("BKPT #0\n") ; // Break into the debugger

    /* When the following line is hit, the variables contain the register values. */
    if (stacked_r0 || stacked_r1 || stacked_r2 || stacked_r3 || stacked_r12 ||
        stacked_lr || stacked_pc || stacked_psr || _CFSR || _HFSR || _DFSR ||
        _AFSR || _MMAR || _BFAR)
    {
        resetblink(BLINK_DIE_HARDFAULT);
        for( ;; );
    }
}

/** The fault handler implementation.  This code is inspired by FreeRTOS.
 */
static void hard_fault_handler(void)
{
    __asm volatile
    (
        "BKPT  #0 \n"
        "MOVS   R0, #4                  \n"
        "MOV    R1, LR                  \n"
        "TST    R0, R1                  \n"
        "BEQ    _MSP                    \n"
        "MRS    R0, PSP                 \n"
        "B      hard_fault_handler_c    \n"
        "_MSP:                          \n"
        "MRS    R0, MSP                 \n"
        "B      hard_fault_handler_c    \n"
        "BX    LR\n"
    );
}

static void nmi_handler(void)
{
    for ( ; /* forever */ ; )
    {
    }
}

static void mpu_fault_handler(void)
{
    for ( ; /* forever */ ; )
    {
    }
}

static void bus_fault_handler(void)
{
    for ( ; /* forever */ ; )
    {
    }
}

static void usage_fault_handler(void)
{
    for ( ; /* forever */ ; )
    {
    }
}

volatile unsigned long _INTCTRL = 0;

/** This is the default handler for exceptions not defined by the application.
 */
void default_interrupt_handler(void) __attribute__ ((weak));
void default_interrupt_handler(void)
{
    _INTCTRL = NVIC_INT_CTRL_R;
    while(1);
    diewith(BLINK_DIE_UNEXPIRQ);
}

void debug_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void porta_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void portb_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void portc_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void portd_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void porte_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void uart0_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void uart1_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void ssi0_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void i2c0_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void pwm0_fault_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void pwm0_0_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void pwm0_1_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void pwm0_2_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void qei0_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void adc0_seq0_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void adc0_seq1_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void adc0_seq2_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void adc0_seq3_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void watchdog_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void timer0a_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void timer0b_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void timer1a_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void timer1b_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void timer2a_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void timer2b_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void comparator0_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void comparator1_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void comparator2_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void system_control_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void flash_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void portf_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void portg_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void porth_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void uart2_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void ssi1_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void timer3a_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void timer3b_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void i2c1_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void qei1_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void can0_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void can1_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void ethernet_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void hibernation_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void usb0_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void pwm0_3_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void dma_software_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void dma_error_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void adc1_seq0_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void adc1_seq1_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void adc1_seq2_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void adc1_seq3_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void i2s0_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void epi_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void portj_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void portk_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void portl_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void ssi2_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void ssi3_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void uart3_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void uart4_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void uart5_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void uart6_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void uart7_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void i2c2_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void i2c3_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void timer4a_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void timer4b_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void timer5a_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void timer5b_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void wide_timer0a_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void wide_timer0b_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void wide_timer1a_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void wide_timer1b_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void wide_timer2a_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void wide_timer2b_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void wide_timer3a_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void wide_timer3b_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void wide_timer4a_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void wide_timer4b_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void wide_timer5a_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void wide_timer5b_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void system_except_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void i2c4_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void i2c5_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void portm_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void portn_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void portp_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void portp0_interrupt_handler(void) __attribute__ ((weak, alias ("portp_interrupt_handler")));
void portp1_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void portp2_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void portp3_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void portp4_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void portp5_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void portp6_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void portp7_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void pwm1_0_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void pwm1_1_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void pwm1_2_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void pwm1_3_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));
void pwm1_fault_interrupt_handler(void) __attribute__ ((weak, alias ("default_interrupt_handler")));


